In [2]:
import pandas as pd

In [3]:
data = pd.read_csv("mytitanic_data.csv")

how do i select a specific column in a pandas dataframe

In [ ]:
col = data["Survived"]
col

how do i filter rows in  a pandas dataframe based on  condition

In [ ]:
rows = data.loc[0:0]
rows

how do i rename columns in a pandas dataframe

In [ ]:
data.rename(columns={'PassengerId':'ID'}, inplace=True)
data

how do i sort a pandas dataframe by a specific columns

In [ ]:
sorted_data = data.sort_values(by='Survived', ascending=True)
sorted_data

how do i drop duplicate rows in a pandas dataframe

In [ ]:
duplicated_row = data.iloc[[0]]

data = pd.concat([data, duplicated_row], ignore_index=True)
data = data.drop_duplicates()
data

how do i calculate summary statistics (mean,median etc) for a pandas Dataframe

In [ ]:
data.describe()

how do i add a new column to a pandas dataframe

In [ ]:
data["date"] = "2-2-1967"
data

how do i group a pandas dataframe by one or multiple columns

In [4]:
grouped_single_column = data.groupby('Survived')
grouped_single_column

In [ ]:
grouped_multiple_columns = data.groupby(['Survived', 'PassengerId'])
grouped_multiple_columns

How do i perform left, right, outer join on two pandas dataframes

In [85]:
data2 = pd.read_csv("Salaries.csv")

In [ ]:
#left join
left_join_df = pd.merge(data, data2, how='left', on='merge_key')
left_join_df

#need two dataframe with one column same replace merge_key with that column name

In [ ]:
#right join
right_join_df = pd.merge(data, data2, how='right', on='merge_key')

In [ ]:
#outer join
outer_join_df = pd.merge(data, data2, how='outer', on='merge_key')

How do i handle missing data in pandas dataframe

In [ ]:
# Detect missing values
missing_values = data.isna()

# Get summary of missing values
data.info()

In [ ]:
# Drop rows with missing values
df_cleaned_rows = data.dropna(axis=0)

# Drop columns with missing values
df_cleaned_columns = data.dropna(axis=1)

# Drop rows with at least 3 non-null values
df_thresh = data.dropna(thresh=3)

In [ ]:
# Replace missing values with a specified value
df_filled = data.fillna(value)

# Replace missing values with mean of the column
df_filled_mean = data.fillna(data.mean())

# Replace missing values with mode of the column
df_filled_mode = data.fillna(data.mode().iloc[0])

In [ ]:
# Interpolate missing values
df_interpolated = data.interpolate()

how i convert a pandas dataframe to a numpy array

In [87]:
import numpy as np

In [ ]:
arr = np.array(data)
arr

how do i merge two pandas dataframe on a specific column

In [4]:
data = pd.read_csv("titanic.csv")
data1 = pd.read_csv("mytitanic_data.csv")

In [ ]:
merged_df = pd.merge(data, data1, on='Survived', how='inner')

merged_df

how do i pivot a pandas dataframe

In [ ]:
pivot_df = data.pivot(index='PassengerId', columns='Survived', values='Age')
pivot_df

how do i read a csv file into pandas dataframe

In [ ]:
data2 = pd.read_csv("titanic.csv")

how do i write a pandas dataframe to a csv file

In [8]:
data.to_csv('new_CSV_file.csv', index=False)

How do i convert a pandas dataframe to a json file

In [ ]:
data.to_json('csv_json.json', orient='records')

how do i apply a function to a column in a pandas dataframe

In [35]:
data = pd.read_csv('titanic.csv')

In [11]:
def square(x):
    return x ** 2

data['Age'] = data['Age'].apply(square)

how do i drop a column from a pandas dataframe

In [22]:
data = pd.read_csv("titanic.csv")

In [23]:
data.drop(columns=['SibSp'], inplace=True)

how do i change the datatype of a column in a pandas dataframe

In [27]:
data['Age'] = data['Age'].astype(str)

how do i find the unique values in a column of a pandas dataframe

In [ ]:
unique_values = data['PassengerId'].unique()
unique_values

how do i select the first n rows from a pandas dataframe

In [ ]:
first_n = data.head(10)
print(first_n)

How do I reset the index of a Pandas DataFrame

In [6]:
# Reset index
data.reset_index(drop=True, inplace=True)
data

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,869,0,3,"van Melkebeke, Mr. Philemon",male,30.0,0,0,345777,9.5000,NaN,S
1,1,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
2,2,362,0,2,"del Carlo, Mr. Sebastiano",male,29.0,1,0,SC/PARIS 2167,27.7208,NaN,C
3,3,283,0,3,"de Pelsmaeker, Mr. Alfons",male,16.0,0,0,345778,9.5000,NaN,S
4,4,287,1,3,"de Mulder, Mr. Theodore",male,30.0,0,0,345774,9.5000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
887,887,309,0,2,"Abelson, Mr. Samuel",male,30.0,1,0,P/PP 3381,24.0000,NaN,C
888,888,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.2500,NaN,S
889,889,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.2500,NaN,S
890,890,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.5500,NaN,S

How do I slice a Pandas DataFrame by row

In [17]:
slice =  data.iloc[0:2]
slice

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,484.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1444.0,1,0,PC 17599,71.2833,C85,C

How do I select the last n rows from a Pandas DataFrame

In [19]:
last = data.tail(3)
last

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,676.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,1024.0,0,0,370376,7.75,NaN,Q

How do I select a random sample of rows from a Pandas DataFrame

In [20]:
rand = data.sample()
rand

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
775,776,0,3,"Myhrman, Mr. Pehr Fabian Oliver Malkolm",male,324.0,0,0,347078,7.75,NaN,S

How do I create a pivot table in Pandas

In [ ]:
df = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob', 'Charlie'],
    'Category': ['A', 'A', 'B', 'B', 'A', 'B'],
    'Value': [10, 20, 30, 40, 50, 60]
}
d = pd.DataFrame(df)

# Create a pivot table
pivot_df = pd.pivot_table(d, values='Value', index='Name', columns='Category', aggfunc='sum')

print(pivot_df)

How do I concatenate two Pandas DataFrames

In [ ]:
concat = pd.concat([data,data1],axis=1)
concat

How do I create a copy of a Pandas DataFrame?

In [ ]:
data_copy = data.copy()
data_copy

How do I drop rows with NaN values in a Pandas DataFrame?

In [ ]:
data = data.fillna(10)
data.info()

How do I fill in missing values in a Pandas DataFrame?

In [ ]:
data1_miss = data1.isna()
data1_miss

data1.fillna(method='ffill')

data1.info()

How do I perform a shift operation on a column in a Pandas DataFrame?

In [ ]:
data1 = pd.read_csv("titanic.csv")
data1

In [ ]:
data1['age'] = data1['Age'].shift(periods=1)
data1

How do I perform a cumulative product operation on a column in a Pandas DataFrame?

In [ ]:
data1['product'] = data1['Survived'].cumprod()
data1

How do I perform a cumulative maximum operation on a column in a Pandas DataFrame?

In [ ]:
data1['max'] = data1['Survived'].cummax()
data1

How do I calculate the moving average of a column in a Pandas DataFrame?

In [ ]:
data1['avg'] = data1['Survived'].rolling(window=3).mean()
data1

How do I calculate the exponential moving average of a column in a Pandas DataFrame?

How do I calculate the cumulative minimum operation on a column in a Pandas DataFrame?

In [55]:
data1['min'] = data1['Survived'].cummin()